examples/coupled/single/openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            patch;
        nFaces          100;
        startFace       13900;
    }
    bottom
    {
        type            patch;
        nFaces          100;
        startFace       14000;
    }
    streamwiseIn
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       14100;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  streamwiseOut;
    }
    streamwiseOut
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       14600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  streamwiseIn;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       15100;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       15600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
)

// ************************************************************************* //
